/*
 * 여러줄 주석
 * 1. 자바 실행 과정
 * 	.java =====> class명과 동일
 * ---------------원시소스(프로그래머만 아는 언어) : 컴퓨터는 알 수 없는 소스
 * |
 * | 컴퓨터가 인식하는 언어로 변경(컴파일) ==> javac
 * .class ======> 바이트 코드(기계어)
 * |
 * | 한줄씩 번역(인터프리터) ==> java
 * 번역된 내용을 화면에 출력
 * ------------------------javac + java => ctrl+f11
 * 2. 자바 사용
 * --------1) 호환성 (운영체제에 상관없이 작동) => 운영체제의 독립적이다. 
 * --------2) 무료$jdk 1.8까지는 라이센스가 없음$ => jdk$자바 개발하는 툴$ 1.9 (오라클에서 제작) => 라이센스 있음
 * --------3) 버전 호환 $가장 높은 버전 다운 받는다고 다 작동하는 것이 아니다$ 
 * 3. 자바의 발전 과정(백서) ==> 1995/5/23 =? 1996(JavaApplet) => 동적 웹 만드는데 사용
 * ===>분당 / 판교, 강남, 상암, 구디/가디(SI/SM) 
 *     ---------솔루션 
 * 자바
 * 오라클
 * HTML/CSS/JS
 * Ajax / Jquery
 * MVC
 * ----------------------1
 * Spring
 *  VueJS
 * ----------------------2
 * Spring-Boot
 * React
 * ----------------------3
 * $과목 중에 한 가지는 잘 하자!! 나머지는 흐름 파악용. 개발을 하고 기획자로 가는 것을 추천$
 * $자바, jsp, vue js, react(☆) 열심히 해라!$
 * $앞부분을 몰라도 계속 나오는 내용이라서 공부 계속 할 수 있음$
 * 
 * ==> 1. 앞으로 (전진) 5.5개월
 * $뒷부분을 따라 붙으면서 안 되는 부분만 따로 공부하는 것. 아니면 뒷 부분까지 따라오지 못함. $
 * 
 * 자바 : 가전 제품 (게임기 : 세븐 스타) ====> 임베디드 (모바일)
 *      => 그린 프로젝트 (통합 리모콘) ==> 후원자가 없어서 망함.
 *      => 네스케이프(브라우저 만드는 업체)에서 인수함. ==> 웹 프로그램(자바스크립트)
 *      => 독립함(자바) <====> MS 
 *      ------------
 *      운영체제는 가짐(솔라리스, 언어) ==> 데이터베이스를 갖고 싶어함.(MySQL인수함) ==> 부도 ==> 오라클에서 인수(돈 벌곳이 없어서 유료화함)
 *      openjdk/jdk
 *      -------
 *      우리나라가 많이 사용. 꽁짜
 *      => 자바 개발자 : 제임스 고슬링 / 아서벤
 *                    ----          ---
 *                    JA            VA ===>Java
 *                    => C++ / Java 객체 지향(사람 중심, 단일 상속) => C++(C문법) => javah(c언어랑 호환)
 *                     -----
 *                     C with Class(클래스를 가진 C) => 객체지향 시작(기계 중심 프로그램, 다중 상속)
 *      
 *      ====특징(면접에서 많이 나옴) => 3 page
 *      
 */
// 한줄 주석
//메인을 까먹고 안 하면
//main + ctrl + space 하면 단축기
//main은 프로그램의 시작점
public class MainClass_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
